ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/scb/cy_scb_spi.h
/* Configuration functions */
__STATIC_INLINE void Cy_SCB_SPI_SetActiveSlaveSelect(CySCB_Type *base, uint32_t slaveSelect);
__STATIC_INLINE void Cy_SCB_SPI_SetActiveSlaveSelectPolarity(CySCB_Type *base, uint32_t slaveSelect, uint32_t polarity);

/* Bus status */
__STATIC_INLINE bool Cy_SCB_SPI_IsBusBusy(CySCB_Type const *base);

/* Low-level: Receive direction */
__STATIC_INLINE uint32_t Cy_SCB_SPI_Read     (CySCB_Type const *base);
__STATIC_INLINE uint32_t Cy_SCB_SPI_ReadArray(CySCB_Type const *base, void *rxBuf, uint32_t size);

__STATIC_INLINE uint32_t Cy_SCB_SPI_GetRxFifoStatus  (CySCB_Type const *base);
__STATIC_INLINE void     Cy_SCB_SPI_ClearRxFifoStatus(CySCB_Type *base, uint32_t clearMask);
__STATIC_INLINE uint32_t Cy_SCB_SPI_GetNumInRxFifo   (CySCB_Type const *base);
__STATIC_INLINE void     Cy_SCB_SPI_ClearRxFifo      (CySCB_Type *base);

/* Low-level: Transmit direction */
__STATIC_INLINE uint32_t Cy_SCB_SPI_Write     (CySCB_Type *base, uint32_t data);
__STATIC_INLINE uint32_t Cy_SCB_SPI_WriteArray(CySCB_Type *base, void *txBuf, uint32_t size);
__STATIC_INLINE void     Cy_SCB_SPI_WriteArrayBlocking(CySCB_Type *base,  void *txBuf, uint32_t size);

__STATIC_INLINE uint32_t Cy_SCB_SPI_GetTxFifoStatus  (CySCB_Type const *base);
__STATIC_INLINE void     Cy_SCB_SPI_ClearTxFifoStatus(CySCB_Type *base, uint32_t clearMask);
__STATIC_INLINE uint32_t Cy_SCB_SPI_GetNumInTxFifo   (CySCB_Type const *base);
__STATIC_INLINE bool     Cy_SCB_SPI_IsTxComplete     (CySCB_Type const *base);
__STATIC_INLINE void     Cy_SCB_SPI_ClearTxFifo      (CySCB_Type *base);

/* Low-level: Master or slave status */
__STATIC_INLINE uint32_t Cy_SCB_SPI_GetSlaveMasterStatus  (CySCB_Type const *base);
__STATIC_INLINE void     Cy_SCB_SPI_ClearSlaveMasterStatus(CySCB_Type *base, uint32_t clearMask);

/* High-level: callback */
__STATIC_INLINE void Cy_SCB_SPI_RegisterCallback(CySCB_Type const *base, scb_spi_handle_events_t callback,
                                                 cy_stc_scb_spi_context_t *context);

/* High-level: Transfer functions */
cy_en_scb_spi_status_t Cy_SCB_SPI_Transfer(CySCB_Type *base, void *txBuf, void *rxBuf, uint32_t size,
                                           cy_stc_scb_spi_context_t *context);
void     Cy_SCB_SPI_AbortTransfer    (CySCB_Type *base, cy_stc_scb_spi_context_t *context);
uint32_t Cy_SCB_SPI_GetNumTransfered (CySCB_Type const *base, cy_stc_scb_spi_context_t const *context);
uint32_t Cy_SCB_SPI_GetTransferStatus(CySCB_Type const *base,cy_stc_scb_spi_context_t const *context);

/* High-level: Interrupt handler */
void Cy_SCB_SPI_Interrupt(CySCB_Type *base, cy_stc_scb_spi_context_t *context);
/** \} group_scb_spi_functions */


/***************************************
*            API Constants
***************************************/

/**
* \addtogroup group_scb_spi_macro
* \{
*/

/**
* \defgroup group_scb_spi_macro_modes SPI Modes
* \{
*/
#define CY_SCB_SPI_SLAVE  (0UL) /**< Configures SCB for SPI Slave operation  */
#define CY_SCB_SPI_MASTER (1UL) /**< Configures SCB for SPI Master operation */
/** \} group_scb_spi_macro_modes */

/**
* \defgroup group_scb_spi_macro_sub_modes SPI Submodes
* \{
*/
/** Configures an SPI for a standard Motorola SPI operation */
#define CY_SCB_SPI_MOTOROLA        (0UL)

/**
* Configures the SPI for the TI SPI operation. In the TI mode, the slave select
* is a pulse. In this case, the pulse coincides with the first bit.
*/
#define CY_SCB_SPI_TI_COINCIDES    (1UL)

/**
* Configures an SPI for the TI SPI operation, in the TI mode. The slave select
* is a pulse. In this case the pulse precedes the first bit.
*/
#define CY_SCB_SPI_TI_PRECEDES     (1UL | CY_SCB_SPI_TI_PRECEDE)

/**
* Configures an SPI for the National SPI operation. This is a half-duplex
* mode of operation.
*/
#define CY_SCB_SPI_NATIONAL        (2UL)
/** \} group_scb_spi_macro_sub_modes */

/**
* \defgroup group_scb_spi_macro_sclk_modes SPI SCLK Modes
* \{
*/
#define CY_SCB_SPI_CPHA0_CPOL0 (0UL)   /**< Clock is active low, data is changed on first edge   */
#define CY_SCB_SPI_CPHA0_CPOL1 (1UL)   /**< Clock is active high, data is changed on first edge  */
#define CY_SCB_SPI_CPHA1_CPOL0 (2UL)   /**< Clock is active low, data is changed on second edge  */
#define CY_SCB_SPI_CPHA1_CPOL1 (3UL)   /**< Clock is active high, data is changed on second edge */
/** \} group_scb_spi_macro_sclk_modes */

/**
* \defgroup group_scb_spi_macro_slave_select SPI Slave Selects
* \{
*/
#define CY_SCB_SPI_SLAVE_SELECT0   (0UL)   /**< Master will use Slave Select 0 */
#define CY_SCB_SPI_SLAVE_SELECT1   (1UL)   /**< Master will use Slave Select 1 */
#define CY_SCB_SPI_SLAVE_SELECT2   (2UL)   /**< Master will use Slave Select 2 */
#define CY_SCB_SPI_SLAVE_SELECT3   (3UL)   /**< Master will use Slave Select 3 */
/** \} group_scb_spi_macro_slave_select */

/**
* \defgroup group_scb_spi_macro_tx_fifo_status SPI TX FIFO Statuses
* Each SPI TX FIFO status is encoded in a separate bit. Therefore multiple bits
* may be set to indicate the current status.
* \{
*/
/** The number of entries in the TX FIFO is less than the TX FIFO trigger level
* value
*/
#define CY_SCB_SPI_TX_TRIGGER      (SCB_INTR_TX_TRIGGER_Msk)

/** The TX FIFO is not full, there is a space for more data */
#define CY_SCB_SPI_TX_NOT_FULL     (SCB_INTR_TX_NOT_FULL_Msk)

/**
* The TX FIFO is empty, note that there may still be data in the shift register.
*/
#define CY_SCB_SPI_TX_EMPTY        (SCB_INTR_TX_EMPTY_Msk)

/** An attempt to write to the full TX FIFO */
#define CY_SCB_SPI_TX_OVERFLOW    (SCB_INTR_TX_OVERFLOW_Msk)

/**
* Applicable only for the slave mode. The master tried to read more
* data elements than available.
*/
#define CY_SCB_SPI_TX_UNDERFLOW    (SCB_INTR_TX_UNDERFLOW_Msk)
/** \} group_scb_spi_macro_tx_fifo_status */

/**
* \defgroup group_scb_spi_macro_rx_fifo_status SPI RX FIFO Statuses
* \{
* Each SPI RX FIFO status is encoded in a separate bit. Therefore, multiple
* bits may be set to indicate the current status.
*/
/** The number of entries in the RX FIFO is more than the RX FIFO trigger
* level value.
*/
#define CY_SCB_SPI_RX_TRIGGER      (SCB_INTR_RX_TRIGGER_Msk)

/** The RX FIFO is not empty, there is data to read */
#define CY_SCB_SPI_RX_NOT_EMPTY    (SCB_INTR_RX_NOT_EMPTY_Msk)

/**
* The RX FIFO is full. There is no more space for additional data.
* Any additional data will be dropped.
*/
#define CY_SCB_SPI_RX_FULL         (SCB_INTR_RX_FULL_Msk)

/**
* The RX FIFO was full and there was an attempt to write to it.
* This additional data was dropped.
*/
#define CY_SCB_SPI_RX_OVERFLOW     (SCB_INTR_RX_OVERFLOW_Msk)

/** An attempt to read from an empty RX FIFO */
#define CY_SCB_SPI_RX_UNDERFLOW    (SCB_INTR_RX_UNDERFLOW_Msk)
/** \} group_scb_spi_macro_rx_fifo_status */

/**
* \defgroup group_scb_spi_macro_master_slave_status SPI Master and Slave Statuses
* \{
*/
/** The slave was deselected at the wrong time */
#define CY_SCB_SPI_SLAVE_ERR       (SCB_INTR_S_SPI_BUS_ERROR_Msk)

/** The master has transmitted all data elements from FIFO and shifter */
#define CY_SCB_SPI_MASTER_DONE     (SCB_INTR_M_SPI_DONE_Msk)
/** \} group_scb_spi_macro_master_slave_status */

/**
* \defgroup group_scb_spi_macro_xfer_status SPI Transfer Status
* \{
* Each SPI transfer status is encoded in a separate bit, therefore multiple bits
* may be set to indicate the current status.
*/
/**
* Transfer started by \ref Cy_SCB_SPI_Transfer is in progress.
*/
#define CY_SCB_SPI_TRANSFER_ACTIVE     (0x01UL)

/**
* All TX data from \ref Cy_SCB_SPI_Transfer is in the TX FIFO.
*/
#define CY_SCB_SPI_TRANSFER_IN_FIFO    (0x02UL)

/** The slave was deselected at the wrong time. */
#define CY_SCB_SPI_SLAVE_TRANSFER_ERR  (SCB_INTR_S_SPI_BUS_ERROR_Msk)

/**
* RX FIFO was full and there was an attempt to write to it.
* This additional data was dropped.
*/
#define CY_SCB_SPI_TRANSFER_OVERFLOW   (SCB_INTR_RX_OVERFLOW_Msk)

/**
* Applicable only for the slave mode. The master tried to read more
* data elements than available in the TX FIFO.
*/
#define CY_SCB_SPI_TRANSFER_UNDERFLOW  (SCB_INTR_TX_UNDERFLOW_Msk)
/** \} group_scb_spi_macro_xfer_status */

/**
* \defgroup group_scb_spi_macro_callback_events SPI Callback Events
* \{
* Only single event is notified by the callback.
*/
/** All TX data from \ref Cy_SCB_SPI_Transfer is in the TX FIFO.*/
#define CY_SCB_SPI_TRANSFER_IN_FIFO_EVENT  (0x01U)

/** The transfer started by \ref Cy_SCB_SPI_Transfer is complete.*/
#define CY_SCB_SPI_TRANSFER_CMPLT_EVENT    (0x02U)

/**
* An error occurred during the transfer. This includes overflow, underflow
* and a transfer error. Check \ref Cy_SCB_SPI_GetTransferStatus.
*/
#define CY_SCB_SPI_TRANSFER_ERR_EVENT      (0x04U)
/** \} group_scb_spi_macro_callback_events */

/**
* \defgroup group_scb_spi_macro_polarity SPI Polarity
* \{
*/
#define CY_SCB_SPI_ACTIVE_LOW  (0UL) /**< Signal in question is active low */
#define CY_SCB_SPI_ACTIVE_HIGH (1UL) /**< Signal in question is active high */
/** \} group_scb_spi_macro_polarity */

